# DataFrames

DataFrame é o elemeto mais importante dos Pandas e são diretamente inspirados pela linguagem de programação R. Podemos pensar em um DataFrame como um monte de objetos da série juntos para compartilhar o mesmo índice. Vamos usar Pandas para explorar esse tópico!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Seleção e indexação

Vamos aprender os vários métodos para pegar dados de um DataFrame

In [5]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [6]:
# Passando uma lista com nomes das colunas
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [7]:
# Sintaxe SQL (Não recomendado. Pode ser que confunda o valor com uma função)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

As colunas dos DataFrames são Series

In [8]:
type(df['W'])

pandas.core.series.Series

** Criando uma coluna: **

In [9]:
df['new'] = df['W'] + df['Y']

In [10]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

** Removendo colunas **

In [11]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
# Porém, tal exclusão só ocorrerá se especificada no parâmetro inplace
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
df.drop('new',axis=1,inplace=True)

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Também podemos deletar colunas desta forma:

In [15]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

** Selecionando linhas: **

In [16]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Ou selecione com base na posição em vez do rótulo

In [17]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

** Selecionando o subconjunto de linhas e colunas **

In [18]:
df.loc['B','Y']

-0.84807698340363147

In [20]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Seleção condicional

Uma característica importante dos pandas é a seleção condicional usando notação de colchetes, muito semelhante ao numpy:

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [23]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [26]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

Para duas condições, você pode usar | e & com parênteses:

In [27]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

## Mais Detalhes do Índice

Vamos discutir mais alguns recursos de indexação, incluindo resetar o índice ou configurá-lo de outra forma. Também falaremos sobre hierarquia de índice!

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
# Redefinir para o padrão 0,1 ... n índice
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [30]:
novoind = 'CA NY WY OR CO'.split()

In [32]:
df['Estados'] = novoind

In [33]:
df

          W         X         Y         Z States Estados
A  2.706850  0.628133  0.907969  0.503826     CA      CA
B  0.651118 -0.319318 -0.848077  0.605965     NY      NY
C -2.018168  0.740122  0.528813 -0.589001     WY      WY
D  0.188695 -0.758872 -0.933237  0.955057     OR      OR
E  0.190794  1.978757  2.605967  0.683509     CO      CO

In [34]:
df.set_index('Estados')

                W         X         Y         Z States
Estados
CA       2.706850  0.628133  0.907969  0.503826     CA
NY       0.651118 -0.319318 -0.848077  0.605965     NY
WY      -2.018168  0.740122  0.528813 -0.589001     WY
OR       0.188695 -0.758872 -0.933237  0.955057     OR
CO       0.190794  1.978757  2.605967  0.683509     CO

In [35]:
df

          W         X         Y         Z States Estados
A  2.706850  0.628133  0.907969  0.503826     CA      CA
B  0.651118 -0.319318 -0.848077  0.605965     NY      NY
C -2.018168  0.740122  0.528813 -0.589001     WY      WY
D  0.188695 -0.758872 -0.933237  0.955057     OR      OR
E  0.190794  1.978757  2.605967  0.683509     CO      CO

In [36]:
df.set_index('Estados',inplace=True)

In [37]:
df

                W         X         Y         Z States
Estados
CA       2.706850  0.628133  0.907969  0.503826     CA
NY       0.651118 -0.319318 -0.848077  0.605965     NY
WY      -2.018168  0.740122  0.528813 -0.589001     WY
OR       0.188695 -0.758872 -0.933237  0.955057     OR
CO       0.190794  1.978757  2.605967  0.683509     CO

## Hierarquia de índices e índices múltiplos

Vamos examinar como trabalhar com o Multi-Index, primeiro criaremos um exemplo rápido de como seria um DataFrame Multi-Indexado:

In [39]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [40]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [41]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

Agora vamos mostrar como indexar isso! Para a hierarquia de índice, usamos df.loc []. Se este fosse no eixo das colunas, você usaria a notação de suporte normal df []. Chamar um nível do índice retorna um sub-dataframe:

In [42]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [43]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [44]:
df.index.names

FrozenList([None, None])

In [45]:
df.index.names = ['Grupo','Número']

In [46]:
df

                     A         B
Grupo Número
G1    1       0.302665  1.693723
      2      -1.706086 -1.159119
      3      -0.134841  0.390528
G2    1       0.166905  0.184502
      2       0.807706  0.072960
      3       0.638787  0.329646

In [47]:
df.xs('G1')

               A         B
Número
1       0.302665  1.693723
2      -1.706086 -1.159119
3      -0.134841  0.390528

In [48]:
df.xs(['G1',1])

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [49]:
df.xs(1,level='Número')

              A         B
Grupo
G1     0.302665  1.693723
G2     0.166905  0.184502

## Futebol

Exemplos com um pouco de futebol, os artilheiros do Campeonato Brasileiro de 2017.

In [8]:
artilheiros = pd.DataFrame(
    [
    ['Jô', 18, 32, 'Corinthians'], 
    ['Henrique Dourado', 18, 34, 'Fluminense'], 
    ['André', 16, 35, 'Sport'], 
    ['Lucca', 13, 37, 'Ponte Preta'], 
    ['Edigar Junior', 12, 26, 'Bahia'], 
    ['Fred', 12, 29, 'Atlético Mineiro'], 
    ['Diego Souza', 11, 27, 'Sport'], 
    ['Thiago Neves', 11, 33, 'Cruzeiro'],
    ['Roger', 10, 20, 'Botafogo'],
    ['Tréllez', 10, 23, 'Vitória'],
    ['Diego', 10, 27, 'Flamengo']
    ],
    columns=['Jogador', 'Gols', 'Jogos', 'Equipe'])
artilheiros

             Jogador  Gols  Jogos            Equipe
0                 Jô    18     32       Corinthians
1   Henrique Dourado    18     34        Fluminense
2              André    16     35             Sport
3              Lucca    13     37       Ponte Preta
4      Edigar Junior    12     26             Bahia
5               Fred    12     29  Atlético Mineiro
6        Diego Souza    11     27             Sport
7       Thiago Neves    11     33          Cruzeiro
8              Roger    10     20          Botafogo
9            Tréllez    10     23           Vitória
10             Diego    10     27          Flamengo

In [11]:
artilheiros.describe()

            Gols      Jogos
count  11.000000  11.000000
mean   12.818182  29.363636
std     3.092513   5.315500
min    10.000000  20.000000
25%    10.500000  26.500000
50%    12.000000  29.000000
75%    14.500000  33.500000
max    18.000000  37.000000

In [18]:
# Criar coluna com media de gols por jogos disputados
artilheiros['Media'] = round((artilheiros['Gols'] / artilheiros['Jogos']),2)
artilheiros

             Jogador  Gols  Jogos            Equipe  Media
0                 Jô    18     32       Corinthians   0.56
1   Henrique Dourado    18     34        Fluminense   0.53
2              André    16     35             Sport   0.46
3              Lucca    13     37       Ponte Preta   0.35
4      Edigar Junior    12     26             Bahia   0.46
5               Fred    12     29  Atlético Mineiro   0.41
6        Diego Souza    11     27             Sport   0.41
7       Thiago Neves    11     33          Cruzeiro   0.33
8              Roger    10     20          Botafogo   0.50
9            Tréllez    10     23           Vitória   0.43
10             Diego    10     27          Flamengo   0.37

In [25]:
artilheiros['Media'].max()

0.56000000000000005

In [26]:
artilheiros.iloc[2]['Gols'] #retornar linha índice 2, coluna 'gols'

16

In [28]:
# dimensões da tabela (l x c)
artilheiros.shape

(11, 5)

## Estados brasileiros
Exemplos com índices

In [5]:
estados = pd.DataFrame(
    [
        ['PE', 'Pernambuco', 'Recife'], ['RJ', 'Rio de Janeiro', 'Rio de Janeiro'],
        ['PB', 'Paraíba', 'João Pessoa'], ['SP', 'São Paulo', 'São Paulo'],
        ['MG', 'Minas Gerais', 'Belo Horizonte'], ['CE', 'Ceará', 'Fortaleza'],
        ['AC', 'Acre', 'Rio Branco'], ['MA', 'Maranhão', 'São Luís'], ['RN', 'Rio Grande do Norte', 'Natal'],
        ['PR', 'Paraná', 'Curitiba'], ['RS', 'Rio Grande do Sul', 'Porto Alegre']
    ], columns=['Sigla', 'Nome', 'Capital']
)
estados

   Sigla                 Nome         Capital
0     PE           Pernambuco          Recife
1     RJ       Rio de Janeiro  Rio de Janeiro
2     PB              Paraíba     João Pessoa
3     SP            São Paulo       São Paulo
4     MG         Minas Gerais  Belo Horizonte
5     CE                Ceará       Fortaleza
6     AC                 Acre      Rio Branco
7     MA             Maranhão        São Luís
8     RN  Rio Grande do Norte           Natal
9     PR               Paraná        Curitiba
10    RS    Rio Grande do Sul    Porto Alegre

In [10]:
estados.index

RangeIndex(start=0, stop=11, step=1)

In [11]:
estados.ix[0] # linha índice 0

Sigla              PE
Nome       Pernambuco
Capital        Recife
Name: 0, dtype: object

In [12]:
df.iloc[0] # linha índice 0

Sigla              PE
Nome       Pernambuco
Capital        Recife
Name: 0, dtype: object

In [14]:
# Refaz os índices do dataFrame, que antes começava em zero, agora começa com valor 1
estados.index = pd.Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11])
estados

   Sigla                 Nome         Capital
1     PE           Pernambuco          Recife
2     RJ       Rio de Janeiro  Rio de Janeiro
3     PB              Paraíba     João Pessoa
4     SP            São Paulo       São Paulo
5     MG         Minas Gerais  Belo Horizonte
6     CE                Ceará       Fortaleza
7     AC                 Acre      Rio Branco
8     MA             Maranhão        São Luís
9     RN  Rio Grande do Norte           Natal
10    PR               Paraná        Curitiba
11    RS    Rio Grande do Sul    Porto Alegre

In [15]:
# Alterar os índices para as siglas dos estados
estados.index = df['Sigla']
estados

      Sigla                 Nome         Capital
Sigla
PE       PE           Pernambuco          Recife
RJ       RJ       Rio de Janeiro  Rio de Janeiro
PB       PB              Paraíba     João Pessoa
SP       SP            São Paulo       São Paulo
MG       MG         Minas Gerais  Belo Horizonte
CE       CE                Ceará       Fortaleza
AC       AC                 Acre      Rio Branco
MA       MA             Maranhão        São Luís
RN       RN  Rio Grande do Norte           Natal
PR       PR               Paraná        Curitiba
RS       RS    Rio Grande do Sul    Porto Alegre

In [20]:
estados.loc['RS'] # ou estados.ix['RS']

Sigla                     RS
Nome       Rio Grande do Sul
Capital         Porto Alegre
Name: RS, dtype: object

In [21]:
# excluir a coluna sigla, agora que ela é o índice
del estados['Sigla']
estados

                      Nome         Capital
Sigla
PE              Pernambuco          Recife
RJ          Rio de Janeiro  Rio de Janeiro
PB                 Paraíba     João Pessoa
SP               São Paulo       São Paulo
MG            Minas Gerais  Belo Horizonte
CE                   Ceará       Fortaleza
AC                    Acre      Rio Branco
MA                Maranhão        São Luís
RN     Rio Grande do Norte           Natal
PR                  Paraná        Curitiba
RS       Rio Grande do Sul    Porto Alegre